Airfoil_KEPS_GAWF/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rho             [1 -3 0 0 0 0 0] 1;

nu              [0 2 -1 0 0 0 0] 1.85e-05;


//CrossPowerLawCoeffs
//{
//    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
//    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
//    m               m [ 0 0 1 0 0 0 0 ] 1;
//    n               n [ 0 0 0 0 0 0 0 ] 1;
//}
//BirdCarreauCoeffs
//{
//    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
//    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
//    k               k [ 0 0 1 0 0 0 0 ] 0;
//    n               n [ 0 0 0 0 0 0 0 ] 1;
//}

// ************************************************************************* //
