Airfoil_KEPS_GAWF/system/skinFriction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
//ref https://cpp.openfoam.org/v9/classFoam_1_1functionObjects_1_1forceCoeffs.html
forces
{   name            forceCoeffs;
    type            forcesCoeffs;
    libs            ("libforces.so");
    log             yes;
    liftDir         (0 1 0);  
    dragDir         (-1 0 0);
    pitchAxis       (0 0 0);
    patches         (airfoil);
    magUInf         69.4;
    lRef            2.4;
    Aref            2.4;
    writeControl    timeStep;
    timeInterval    5;
    pName           p;
    UName           U;
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Redundant for incompressible
}





// ************************************************************************* //
